#+TITLE:       Spacemacs Org-mode and Clojure
#+AUTHOR:      Vladimir Kotushenko
#+EMAIL:       volodymyr.kotushenko@gmail.com
#+DATE:        2019-12-18 
#+URI:         /blog/spacemacs-org-mode-clojure-plotting
#+KEYWORDS:    spacemacs, clojure, org-mode, plotting
#+TAGS:        spcemcs, clojure, beginner, org-mode, plotting, literate programming
#+LANGUAGE:    en
#+OPTIONS:     H:5 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: How to do literate datascience programming in org-mode?

*** Elementary results
    #+begin_src clojure :results pp :exports both :eval never-export
      ;; #+begin_src clojure :results pp
      (defn power [n x]
        (reduce * (repeat x n)))
      (power 2 3)
      ;; #+end_src
    #+end_src

    #+RESULTS:
    : 8

*** Results as table

    List of lists - generate multiplication table
    #+begin_src clojure :results value :exports both :eval never-export
      ;; #+begin_src clojure :results value
      (let [from  1
            to    8
            mults (for [x (range from to)
                        y (range from to)]
                    (* x y))
            table (partition (- to from) mults)]
        (list* (first table)
               'hline
               (rest table)))
    #+end_src

    #+RESULTS:
    | 1 |  2 |  3 |  4 |  5 |  6 |  7 |
    |---+----+----+----+----+----+----|
    | 2 |  4 |  6 |  8 | 10 | 12 | 14 |
    | 3 |  6 |  9 | 12 | 15 | 18 | 21 |
    | 4 |  8 | 12 | 16 | 20 | 24 | 28 |
    | 5 | 10 | 15 | 20 | 25 | 30 | 35 |
    | 6 | 12 | 18 | 24 | 30 | 36 | 42 |
    | 7 | 14 | 21 | 28 | 35 | 42 | 49 |

    Vector of maps
    #+begin_src clojure :results value table :exports both :eval no-exports
      ;; #+begin_src clojure :results value table
      [{:user/name "Bob"
        :user/level :d1
        :note "order # 1"}
       {:user/name "Sara"
        :user/level :l1
        :note "order # 2"}]
      ;; #+end_src
    #+end_src

    #+RESULTS:
    | :user/name | Bob  | :user/level | :d1 | :note | order # 1 |
    | :user/name | Sara | :user/level | :l1 | :note | order # 2 |

    Print raw clojure's pprint table
    #+begin_src clojure :results output  :exports both :eval no-exports
      ;; #+begin_src clojure :results value pp
      (clojure.pprint/print-table 
       [{:user/name "Bob"
         :user/level :d1
         :note "order # 1"}
        {:user/name "Sara"
         :user/level :l1
         :note "order # 2"}])
      ;; #+end_src
    #+end_src

    #+RESULTS:
    : 
    : | :user/name | :user/level |     :note |
    : |------------+-------------+-----------|
    : |        Bob |         :d1 | order # 1 |
    : |       Sara |         :l1 | order # 2 |

    Create out own =print-org-table= helper function

    #+begin_src clojure :results silent :exports code :eval no-exports
      (defn print-org-table
        ([rows] 
         (print-org-table (keys (first rows)) rows))
        ([ks rows]
         (list* ks 'hline
                (map #(for [k ks] (get % k)) rows))))
    #+end_src

    #+begin_src clojure :results value table :exports both :eval no-exports
      ;; #+begin_src clojure :results value table
      (print-org-table [{:user/name "Bob"
                         :user/level :d1
                         :note "order # 1"}
                        {:user/name "Sara"
                         :user/level :l1
                         :note "order # 2"}])
      ;; #+end_src
    #+end_src
    #+RESULTS:
    | :user/name | :user/level | :note     |
    |------------+-------------+-----------|
    | Bob        | :d1         | order # 1 |
    | Sara       | :l1         | order # 2 |

*** List your results
    #+begin_src clojure :results value list :exports both :eval no-exports
      ;; #+begin_src clojure :results value list
      {:user/name "Bob"
       :user/level :d1
       :note "order # 1"}
      ;;#+end_src
    #+end_src

    #+RESULTS:
    - :user/name
    - Bob
    - :user/level
    - :d1
    - :note
    - order # 1



